const { createApp } = Vue

createApp({
  data() {
    return {
      List: [{
        title: "中国民间\n苏式园林治愈你的心灵",
        subtext: "“松风听涛”、“ 菰蒲闻雨”风雨中的声响给人不同的艺术感受。\n“香风满轩花满树”、“暗香浮动月黄昏”以味道取胜。\n“柳色黄金嫩，梨花白雪香”色香兼备，景致无穷。\n“荷风四面”，“冷香亭”则运用通感营造触觉景观。\n“醉翁亭”、“竹下品茗”，一壶清酒一盏茶，优哉游哉",
        imgsrc: "./src/image/bg1.png"
      },{
        title: "中国民间\n苏式园林治愈你的心灵",
        subtext: "“松风听涛”、“ 菰蒲闻雨”风雨中的声响给人不同的艺术感受。\n“香风满轩花满树”、“暗香浮动月黄昏”以味道取胜。\n“柳色黄金嫩，梨花白雪香”色香兼备，景致无穷。\n“荷风四面”，“冷香亭”则运用通感营造触觉景观。\n“醉翁亭”、“竹下品茗”，一壶清酒一盏茶，优哉游哉",
        imgsrc: "./src/image/bg2.png"
      },{
        title: "中国民间\n苏式园林治愈你的心灵",
        subtext: "“松风听涛”、“ 菰蒲闻雨”风雨中的声响给人不同的艺术感受。\n“香风满轩花满树”、“暗香浮动月黄昏”以味道取胜。\n“柳色黄金嫩，梨花白雪香”色香兼备，景致无穷。\n“荷风四面”，“冷香亭”则运用通感营造触觉景观。\n“醉翁亭”、“竹下品茗”，一壶清酒一盏茶，优哉游哉",
        imgsrc: "./src/image/bg3.png"
      },{
        title: "中国民间\n苏式园林治愈你的心灵",
        subtext: "“松风听涛”、“ 菰蒲闻雨”风雨中的声响给人不同的艺术感受。\n“香风满轩花满树”、“暗香浮动月黄昏”以味道取胜。\n“柳色黄金嫩，梨花白雪香”色香兼备，景致无穷。\n“荷风四面”，“冷香亭”则运用通感营造触觉景观。\n“醉翁亭”、“竹下品茗”，一壶清酒一盏茶，优哉游哉",
        imgsrc: "./src/image/bg4.png"
      },{
        title: "中国民间\n苏式园林治愈你的心灵",
        subtext: "“松风听涛”、“ 菰蒲闻雨”风雨中的声响给人不同的艺术感受。\n“香风满轩花满树”、“暗香浮动月黄昏”以味道取胜。\n“柳色黄金嫩，梨花白雪香”色香兼备，景致无穷。\n“荷风四面”，“冷香亭”则运用通感营造触觉景观。\n“醉翁亭”、“竹下品茗”，一壶清酒一盏茶，优哉游哉",
        imgsrc: "./src/image/bg5.png"
      }]
    }
  },
  methods:{
    toDetail(){
      window.location.href= './subPages/detail/detail.html'
    }
  }
}).mount('#explorationPage')